"espk" = "Porta do alto-falante Apple";
"ispk" = "Integrado";
"emic" = "Porta do microfone";
"imic" = "Integrado";
"hdpn" = "Porta do fone de ouvido";
"lini" = "Porta de entrada de áudio";
"lino" = "Porta de saída de áudio";
"spdi" = "Porta de entrada digital óptica";
"spdo" = "Porta de saída digital óptica";
"pci " = "Placa PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Dispositivo de rede";
"blue" = "Bluetooth";
"bluh" = "Fones de Ouvido Bluetooth";
"blus" = "Headset Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
